# Assignment -1

Import the necessary libraries

In [4]:
import pandas as pd
import numpy as np

import matplotlib
import matplotlib.pyplot as plt

 Import the dataset from this(https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

Use sep= "|" while reading the data

In [6]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [7]:
users_df = pd.read_csv(url, sep = "|")
users_df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

# Assign it to a variable called users and use the 'user_id' as index

In [8]:
users = pd.read_csv(url, sep="|", index_col="user_id")
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

# See the first 10 and last 10 entries

In [9]:
print("First 10 entries:-","\n\n", users_df.head(10),"\n\n\nLast 10 entries:-","\n\n",users_df.tail(10))

First 10 entries:-

    user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703


Last 10 entries:-

      user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

# What is the number of observations in the dataset?

In [10]:
print("number of observations:",users_df.count()[0])

number of observations: 943

# What is the number of columns in the dataset?

In [11]:
print("number of columns:",len(users_df.columns))

number of columns: 5

# Print the name of all the columns

In [12]:
print(users_df.columns.tolist())

['user_id', 'age', 'gender', 'occupation', 'zip_code']

# How is the dataset indexed?

In [13]:
print(users_df.index)

RangeIndex(start=0, stop=943, step=1)

# What is the data type of each column?

In [14]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

# Print only the occupation column

In [15]:
users_df['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

# How many different occupations are in this dataset?

In [16]:
users["occupation"].value_counts().count()

21


# What is the most frequent occupation?

In [17]:
users["occupation"].value_counts().head(1)

student    196
Name: occupation, dtype: int64

# DataFrame Info.

In [18]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

# Describe all the columns.

In [19]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [20]:
users_df['age'].describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

In [21]:

users_df['user_id'].describe()

count    943.000000
mean     472.000000
std      272.364951
min        1.000000
25%      236.500000
50%      472.000000
75%      707.500000
max      943.000000
Name: user_id, dtype: float64

In [22]:
users_df['gender'].describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [23]:
users_df['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [24]:
users_df['zip_code'].describe()

count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object

# Summarize only the occupation column

In [25]:
users["occupation"].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

# What is the mean age of users?

In [26]:
users.age.mean()

34.05196182396607

# What is the age with least occurence?

In [27]:
users.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64